EDT/УТ/src/Documents/ВводОстатковПоВзаиморасчетамСКомитентами/ВводОстатковПоВзаиморасчетамСКомитентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводОстатковПоВзаиморасчетамСКомитентами</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКомитентамиПоЗаказам</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКомитентами</registerRecords>
  <attributes>
    <name>ДатаДвижений</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СписыватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписаниеОстатковПоЗаказам</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Комитент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозникновенияЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Корректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВводОстатковПоЗаказам</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Комитент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозникновенияЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Корректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписаниеОстатков</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Комитент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозникновенияЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Корректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасчетовСКомитентами</name>
      <type>
        <types>CatalogRef.СтатьиРасчетовСКомитентами</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВводОстатков</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Комитент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозникновенияЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Корректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасчетовСКомитентами</name>
      <type>
        <types>CatalogRef.СтатьиРасчетовСКомитентами</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/ВзаиморасчетыСКомитентамиПоЗаказам/ВзаиморасчетыСКомитентамиПоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКомитентамиПоЗаказам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВозникновенияЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/AccumulationRegisters/ВзаиморасчетыСКомитентами/ВзаиморасчетыСКомитентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКомитентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВозникновенияЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасчетовСКомитентами</name>
    <type>
      <types>CatalogRef.СтатьиРасчетовСКомитентами</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Documents/ВводОстатковПоВзаиморасчетамСКомитентами/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	СуммаПоВводуОстатков = ЭтотОбъект.ВводОстатков.Итог("Сумма");
	СуммаПоВводуОстатковПоЗаказам = ЭтотОбъект.ВводОстатковПоЗаказам.Итог("Сумма");
	
	СуммаПоСписаниюОстатков = ЭтотОбъект.СписаниеОстатков.Итог("Сумма");
	СуммаПоСписаниюОстатковПоЗаказам = ЭтотОбъект.СписаниеОстатковПоЗаказам.Итог("Сумма");
	
	Если СуммаПоВводуОстатков <> СуммаПоВводуОстатковПоЗаказам 
		ИЛИ СуммаПоСписаниюОстатков <> СуммаПоСписаниюОстатковПоЗаказам Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Суммы по заказам и по статьям расчета не совпадают.
		|Возможны расхождения по учету!");
		
	КонецЕсли;
	
	// регистр ВзаиморасчетыСКомитентами Приход
	Движения.ВзаиморасчетыСКомитентамиПоЗаказам.Записывать = Истина;
	Движения.ВзаиморасчетыСКомитентамиПоЗаказам.БлокироватьДляИзменения = Истина;	
	Движения.ВзаиморасчетыСКомитентамиПоЗаказам.Очистить();
	
	Движения.ВзаиморасчетыСКомитентами.Записывать = Истина;
	Движения.ВзаиморасчетыСКомитентами.БлокироватьДляИзменения = Истина;	
	Движения.ВзаиморасчетыСКомитентами.Очистить();

	Если СписыватьОстатки Тогда
		
		Для Каждого ТекСтрокаСписаниеОстатков Из СписаниеОстатковПоЗаказам Цикл
			Движение = Движения.ВзаиморасчетыСКомитентамиПоЗаказам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления[Строка(ТекСтрокаСписаниеОстатков.ВидДвижения)];
			Движение.Период = ДатаДвижений;
			Движение.Организация = ТекСтрокаСписаниеОстатков.Организация;
			Движение.Комитент = ТекСтрокаСписаниеОстатков.Комитент;
			Движение.ДатаВозникновенияЗадолженности = ТекСтрокаСписаниеОстатков.ДатаВозникновенияЗадолженности;
			Движение.ТипЗаказа = ТекСтрокаСписаниеОстатков.ТипЗаказа;
			Движение.Заказ = ТекСтрокаСписаниеОстатков.Заказ;
			Движение.Сумма = ТекСтрокаСписаниеОстатков.Сумма;
			Движение.Корректировка = ТекСтрокаСписаниеОстатков.Корректировка;
		КонецЦикла;
		
		Для Каждого ТекСтрокаСписаниеОстатков Из СписаниеОстатков Цикл
			Движение = Движения.ВзаиморасчетыСКомитентами.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления[Строка(ТекСтрокаСписаниеОстатков.ВидДвижения)];
			Движение.Период = ДатаДвижений;
			Движение.Организация = ТекСтрокаСписаниеОстатков.Организация;
			Движение.Комитент = ТекСтрокаСписаниеОстатков.Комитент;
			Движение.ДатаВозникновенияЗадолженности = ТекСтрокаСписаниеОстатков.ДатаВозникновенияЗадолженности;
			Движение.Сумма = ТекСтрокаСписаниеОстатков.Сумма;
			Движение.Корректировка = ТекСтрокаСписаниеОстатков.Корректировка;
			Движение.СтатьяРасчетовСКомитентами = ТекСтрокаСписаниеОстатков.СтатьяРасчетовСКомитентами;
		КонецЦикла;
		
	КонецЕсли; 

	Для каждого ТекСтрока Из ВводОстатковПоЗаказам Цикл
		Движение = Движения.ВзаиморасчетыСКомитентамиПоЗаказам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления[Строка(ТекСтрока.ВидДвижения)];
		Движение.Период = ДатаДвижений;
		Движение.Организация = ТекСтрока.Организация;
		Движение.Комитент = ТекСтрока.Комитент;
		Движение.ДатаВозникновенияЗадолженности = ТекСтрока.ДатаВозникновенияЗадолженности;
		Движение.ТипЗаказа = ТекСтрока.ТипЗаказа;
		Движение.Заказ = ТекСтрока.Заказ;
		Движение.Сумма = ТекСтрока.Сумма;
		Движение.Корректировка = ТекСтрока.Корректировка;
	КонецЦикла; 
	
	Для каждого ТекСтрока Из ВводОстатков Цикл
		Движение = Движения.ВзаиморасчетыСКомитентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления[Строка(ТекСтрока.ВидДвижения)];
		Движение.Период = ДатаДвижений;
		Движение.Организация = ТекСтрока.Организация;
		Движение.Комитент = ТекСтрока.Комитент;
		Движение.ДатаВозникновенияЗадолженности = ТекСтрока.ДатаВозникновенияЗадолженности;
		Движение.Сумма = ТекСтрока.Сумма;
		Движение.Корректировка = ТекСтрока.Корректировка;
		Движение.СтатьяРасчетовСКомитентами = ТекСтрока.СтатьяРасчетовСКомитентами;
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;	
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь.Ссылка;
	
	СуммаДокумента = МАКС(СписаниеОстатков.Итог("Сумма"), ВводОстатков.Итог("Сумма"));
	
КонецПроцедуры
